Repository: OpenChain-Project/Specification-Translation-JP
Catalog: OpenChain-LFJ-level2.tmx
Source language: en_us
Languages: ja

source: A study group was formed to consider whether a standard program specification could be created that would: i) facilitate greater quality and consistency of open source compliance information being shared across the industry; and ii) decrease the high transaction costs associated with open source resulting from compliance rework.
ja: こういった背景から、標準的なプログラムの仕様というものを整備することができるかどうか検討する研究グループが形成された。これは、 i) 産業横断的に共有されるオープンソース・コンプライアンスに係る情報の品質と一貫性を促進し; ii)コンプライアンス作業の再実施に起因する、オープンソースに関連するトランザクションコストの低減することを見据えている。

source: As a consequence, at each tier of the supply chain, downstream organizations were frequently redoing the compliance work already performed by other upstream organizations.
ja: 結果として、サプライチェーンのそれぞれの段階において、上流側組織で既に実施したコンプライアンス業務を下流組織で再び実施されていた。

source: Definitions
ja: 用語の定義

source: Distributed Compliance Artifacts - the set of artifacts that an Identified License requires be provided with Supplied Software.
ja: 分散型コンプライアンス生成物 -供給されたソフトウェアとともに特定されたライセンスが提供されることが求められる生成物一式

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.0 of the specification.
ja: すべての要件をそのプログラムが満たしている場合、それは仕様書1.0版での「 OpenChain 適合(OpenChain Conforming)」とみなされる。

source: In accordance with the Vision and Mission, this specification defines a set of requirements that if met, would significantly increases the probability that an open source compliance program had achieved a sufficient level of quality, consistency and completeness; although a program that satisfies all the specification requirements does not guarantee full compliance.
ja: 上記ビジョンとミッションに則り、本仕様書ではこれに適合するならばそのオープンソース・コンプライアンスプログラムは十分なレベルでの品質、一貫性と完全性を獲得している、その可能性を著しく高めてくれるであろう要件の一式を定義する。ただし、本要件のすべてを満たしていたとしてもそのプログラムが完全なコンプライアンスであることを保証するものではない。

source: Introduction
ja: はじめに

source: Mission: Establish requirements to achieve effective management of free/open source software (FOSS) for software supply chain participants, such that the requirements and associated collateral are developed collaboratively and openly by representatives from the software supply chain, open source community, and academia.
ja: ミッション: フリー/オープンソース・ソフトウェア(FOSS)の効果的マネジメントを実現するための 要件 をソフトウェア・サプライチェーンの参加者のために確立すること。こういった要件や関連する付随事項は、オープンに、ソフトウェア・サプライチェーン、オープンソース ・コミュニティやアカデミア（学術研究機関）の関係者それぞれがオープンに協働しながら開発を進めていく

source: OpenChain Conformance Specification
ja: Openchain 適合仕様書

source: Section 2 introduces definitions of key terms used throughout the specification.
ja: 第2節では、仕様として全般で用いられる重要用語について定義していく。

source: Section 3 presents the specification requirements where each one has a list of one or more Verificatione Artifacts.
ja: 第3節では、仕様としての要件を示していく。それぞれに 一つ以上の「検証対象」が存在する。

source: The OpenChain Initiative began in 2013 when a group of software supply chain open source practitioners observed two emerging patterns: 1) significant process similarities existed among organizations with mature open source compliance programs; and 2) there still remained a large number of organizations exchanging software with less developed programs.
ja: OpenChain イニシアチブがスタートした2013年、この年ソフトウェア・サプライチェーンでオープンソースを活用していた実践者たちは、表面化してきている2つのパターンを観測していた：1) 成熟したオープンソース・コンプライアンスプログラムを持つ組織では、そのプロセスに意味ありげな類似性があったが； 2)一方でいまだ多くの組織においてソフトウェアのやり取りするためのプログラムは非先進的なものだった。

source: The Vision and Mission of the OpenChain Initiative are as follows:
ja: OpenChain イニシアチブは以下のビジョンとミッションを有する：

source: The latter observation resulted in a lack of trust in the consistency and quality of the compliance artifacts accompanying the software being exchanged.
ja: 後者では、ソフトウェアのやり取りに付随する、コンプライアンス関連生成物の一貫性や品質について信頼を喪失させる事態を引き起こし、.

source: The requirements represent a base level (minimum) set of requirements a program must satisfy to be considered OpenChain Conforming.
ja: 本要件は、そのプログラムがOpenChain に適合しているとみなすために満足していなければならない、ベースレベル（最低限）の要件セットを示したものである。

source: The specification focuses on the “what” and “why” qualities of a compliance program as opposed to the “how” and “when” considerations.
ja: 本仕様書は、「どうやって(How）」や「いつ(When)」といった考慮ではなく、コンプライアンスプログラムの「何(What)」、「なぜ(Why)」の属性に焦点をあてている。

source: The study group evolved into a work group, and in April 2016, formally organized as a Linux Foundation collaborative project.
ja: 本研究グループは、ワーキンググループへと発展、のち2016年4月 、正式にThe Linux Foundationのコラボレーティブ・プロジェクトとして組織されることとなった。

source: They represent the evidence that must exist in order for a given requirement to be considered satisfied.
ja: これらは提示された要件が満たされているかどうかを検討するために存在しなくてはならない、確証としての役割を担っている。

source: This ensures a practical level of flexibility that enables different organizations to tailor their policies and processes to best fit their objectives.
ja: また本仕様書は、さまざまな組織が自身のポリシーやプロセスが目的にベストフィットするよう仕立て上げられるよう、実用的なレベルでの柔軟性を確保している。

source: Vision: A software supply chain where free/open source software (FOSS) is delivered with trusted and consistent compliance information.
ja: ビジョン： フリー/オープンソース・ソフトウェア(FOSS)が、信頼でき一貫性のあるコンプライアンス情報とともに提供されるソフトウェア・サプライチェーンを実現すること
